# Brewfile

# Tap into alternate versions of casks
tap "homebrew/cask-versions"

# CLI Apps
brew "git"
brew "autojump"
brew "eza"
brew "mas"
brew "htop"
brew "neovim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Desktop Apps
cask "discord"
cask "zen-browser"
cask "fork"
cask "iterm2"
cask "raycast"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "xcodes"

# App Store Apps
mas "Magnet", id: 441258766
mas "Amphetamine", id: 937984704
mas "Dark Noise", id: 1465439395

